/*
    Можете ли вы описать основное различие между циклом .forEach и циклом .map()?
    И в каких случаях каждый из них используется?

    Чтобы понять разницу между ними, давайте посмотрим, что делает каждая функция.

forEach
    - Перебирает элементы в массиве.
    - Вызывает callback-функцию для каждого элемента.
    - Не возвращает значение.

map
    - Перебирает элементы в массиве.
    - "Сопоставляет" каждый элемент с новым элементом, вызывая функцию для каждого элемента,
    создавая в результате новый массив.
 */